{
    "education": [
        {
            "title": "SSC (2006 - 2013)",
            "message": [
                "Completed Secondary School Certificate with 83.09%.",
                "Built a strong foundation in mathematics and science.",
                "Developed analytical and problem-solving skills."
            ]
        },
        {
            "title": "Diploma in Engineering (2013 - 2016)",
            "message": [
                "Completed Diploma in Engineering with 76.53%.",
                "Gained hands-on experience in core engineering subjects.",
                "Worked on practical projects and industrial applications."
            ]
        },
        {
            "title": "Bachelor of Engineering (2016 - 2019)",
            "message": [
                "Completed Bachelor of Engineering.",
                "Developed strong technical and analytical skills.",
                "Worked on projects focusing on real-world applications."
            ]
        },
        {
            "title": "M.Sc (Data Science) (2023 - 2025)",
            "message": [
                "Pursuing Master of Science in Data Science.",
                "Gaining expertise in machine learning, data analysis, and big data technologies.",
                "Working on advanced projects involving predictive modeling and data visualization."
            ]
        }
    ],
    "experience": [
        {
            "title": "CAD Design & Engineering (2019 - 2021)",
            "message": [
                "Created CAD drawings for manufacturing configurations, ensuring high-precision designs.",
                "Directed product design with a focus on consumer comfort and usability.",
                "Managed production processes, ensuring adherence to quality standards and efficient workflow coordination.",
                "Collaborated with internal and external engineering teams to optimize product development.",
                "Built functional prototypes for various projects, refining designs through iterative testing."
            ]
        },
        {
            "title": "Product Design & Development - GGTPL (2021)",
            "message": [
                "Developed and optimized product designs within budget and project timelines.",
                "Utilized SolidWorks, AutoCAD, and CorelDraw for 2D and 3D layouts.",
                "Efficiently selected materials, calculated technical data, and generated BOMs to meet client requirements.",
                "Implemented cost-cutting strategies and ensured material suitability and aesthetics in product development."
            ]
        },
        {
            "title": "Softaculous.ltd (2021 - Current)",
            "message": [
                "Working as a Software Engineer at Softaculous.",
                "Developing and maintaining web-based applications and tools.",
                "Collaborating with cross-functional teams to deliver high-quality software solutions.",
                "Contributing to the development of automation scripts and backend systems."
            ]
        }
    ]
}